Martinsux/app/controllers/twiits_controller.rb

SELECT "twiits".* FROM "twiits"
---
  def index
    @twiits = Twiit.all

INSERT INTO "twiits" ("Title", "Body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Title", "Hello Wrold"], ["Body", "Wii diid iit"], ["created_at", "2018-03-30 21:00:23.113918"], ["updated_at", "2018-03-30 21:00:23.113918"]]
---
  def create
    @twiit = Twiit.new(twiit_params)

    respond_to do |format|
      if @twiit.save

DELETE FROM "twiits" WHERE "twiits"."id" = ?  [["id", 1]]
---
  def destroy
    @twiit.destroy

SELECT  "twiits".* FROM "twiits" WHERE "twiits"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_twiit
      @twiit = Twiit.find(params[:id])